dot_doom.d/config.org
*** File skeleton :init:
This first section defines the template for the subsections, it uses the =no-web=
syntax to include subsections specified as ~<<sub-section-name>>~.

#+name: init.el
#+begin_src emacs-lisp :tangle init.el :noweb no-export :comments no
;;; init.el -*- coding: utf-8-unix; lexical-binding: t; -*-

;; This file controls what Doom modules are enabled and what order they load in.
;; Press 'K' on a module to view its documentation, and 'gd' to browse its directory.

;; I add some special stuff wich I want to load very early.
(load! "pseudo-early-init.el")

(doom!
  :input
  <<doom-input>>

  :completion
  <<doom-completion>>

  :ui
  <<doom-ui>>

  :editor
  <<doom-editor>>

  :emacs
  <<doom-emacs>>

  :term
  <<doom-term>>

  :checkers
  <<doom-checkers>>

  :tools
  <<doom-tools>>

  :os
  <<doom-os>>

  :lang
  <<doom-lang>>

  :email
  <<doom-email>>

  :app
  <<doom-app>>

  :config
  <<doom-config>>
)
#+end_src

*** Input (=:input=)
Enable bidirectional languages support (=bidi=).

#+name: doom-input
#+begin_src emacs-lisp
bidi
#+end_src

*** General (=:config=)
Enable =literate= configuration (like this file!), and some defaults.

#+name: doom-config
#+begin_src emacs-lisp
literate
(default +bindings +smartparens)
#+end_src

*** Completion (=:completion=)
I'm lazy, I like Emacs to complete my writings.

#+name: doom-completion
#+begin_src emacs-lisp
(vertico +icons)
(company +childframe)
#+end_src

*** User interface (=:ui=)
Enables some user interface features for better user experience, the beautiful
=modeline=, the =treemacs= project tree, better version control integration with
=vc-gutter=... and other useful stuff.

#+name: doom-ui
#+begin_src emacs-lisp
deft
doom
doom-dashboard
hl-todo
hydra
modeline
zen
ophints
nav-flash
(vc-gutter +diff-hl +pretty)
(window-select +numbers)
;; (ligatures +extra)
(popup +all +defaults)
(emoji +ascii +unicode +github)
(treemacs +lsp)
workspaces
#+end_src

*** Editor (=:editor=)
Some editing modules, the most important feature is EVIL to enable Vim style
editing in Emacs. I like also to edit with multiple cursors, enable =yasnippet=
support, wrap long lines, auto format support.

#+name: doom-editor
#+begin_src emacs-lisp
(evil +everywhere)
file-templates
fold
format
multiple-cursors
parinfer
snippets
word-wrap
#+end_src

*** Emacs builtin stuff (=:emacs=)
Beautify Emacs builtin packages.

#+name: doom-emacs
#+begin_src emacs-lisp
(dired +dirvish +icons)
(ibuffer +icons)
undo
vc
#+end_src

*** Terminals (=:term=)
Run commands in terminal from Emacs. I use mainly =vterm= on my local machine,
however, I like to have =eshell=, =shell= and =term= installed to use them for remote
file editing (via Tramp).

#+name: doom-term
#+begin_src emacs-lisp
eshell
vterm
shell
term
#+end_src

*** Checkers (=:checkers=)
I like to check my documents for errors while I'm typing. The =grammar= module
enables [[https://languagetool.org/][LanguageTool]] support.

#+name: doom-checkers
#+begin_src emacs-lisp
(syntax +childframe)
(spell +aspell)
(grammar +lsp)
#+end_src

*** Tools (=:tools=)
I enable some useful tools which facilitate my work flow, I like to enable
Docker support, [[https://editorconfig.org][EditorConfig]] is a good feature to have. I like to enable
=lsp-mode= and =dap-mode= for coding and debugging by enabling the =lsp= and =debugger=
modules with =+lsp= support (further customization for =lsp= and =dap= below). =pdf=
adds support through =pdf-tools=, which are great for viewing PDF files inside
Emacs, I also enable some extra tools, like =magit=, =lookup=, =tmux=... etc.

#+name: doom-tools
#+begin_src emacs-lisp
ein
pdf
rgb
gist
make
tmux
direnv
upload
biblio
tree-sitter
editorconfig
(lsp +peek)
(docker +lsp)
(magit +forge)
(debugger +lsp)
(eval +overlay)
(lookup +docsets +dictionary +offline)
#+end_src

*** Operating system (=:os=)
I enable =tty= for better support of terminal editing.

#+name: doom-os
#+begin_src emacs-lisp
(tty +osc)
#+end_src

*** Language support (=:lang=)
Most of the projects I'm working on are mainly written in C/C++, Python, Rust
and some Lisp stuff, I edit also a lot of configuration and data files in
several formats (=csv=, =yaml=, =xml=, =json=, =shell= scripts...). I use Org-mode to
manage all my papers and notes, so I need to enable as many features as I need,
I do enable =plantuml= also to quickly plot UML models withing Org documents.

#+name: doom-lang
#+begin_src emacs-lisp
qt
data
plantuml
emacs-lisp
common-lisp
(ess +lsp)
(yaml +lsp)
(markdown +grip)
(csharp +dotnet)
(racket +lsp +xp)
(lua +lsp +fennel)
(web +tree-sitter)
(ocaml +tree-sitter)
(cc +lsp +tree-sitter)
(sh +lsp +tree-sitter)
(json +lsp +tree-sitter)
(rust +lsp +tree-sitter)
(julia +lsp +tree-sitter)
(latex +lsp +latexmk +fold)
(python +lsp +pyenv +pyright +tree-sitter)
(scheme +chez +mit +chicken +gauche +guile +chibi)
(org +dragndrop +gnuplot +jupyter +pandoc +noter +journal +hugo +present +pomodoro +roam2)
#+end_src

*** Email (=:email=)
I like to use =mu4e= to manage mail mailboxes. The =+org= flag adds =org-msg= support
and =+gmail= adds better management of Gmail accounts.

#+name: doom-email
#+begin_src emacs-lisp
(:if (executable-find "mu") (mu4e +org +gmail))
#+end_src

*** Apps (=:app=)
Emacs contains a ton of applications, some of them are supported by Doom, I like
to use Emacs manage my calendar, chat on IRC, and receive news. I do use EMMS
sometimes to play music without leaving Emacs, and I like to enable support for
=emacs-everywhere=.

#+name: doom-app
#+begin_src emacs-lisp
calendar
irc
emms
everywhere
rss
#+end_src

** Additional packages (=packages.el=) :package:
This section generates Doom's =packages.el=, with the associated configurations
(~use-package!~ blocks).

This file shouldn't be byte compiled.

#+begin_src emacs-lisp :tangle packages.el
;; -*- coding: utf-8-unix; no-byte-compile: t; -*-
#+end_src

* General Emacs settings :global:
** User information :user:info:

#+begin_src emacs-lisp
(setq user-full-name "Abdelhak Bougouffa"
      user-mail-address "abougouffa@fedoraproject.org")
#+end_src

** Secrets :gpg:pass:secret:
Set the path to my GPG encrypted secrets. I like to set the cache expiry to =nil=
instead of the default 2 hours.

#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo.gpg")
      auth-source-do-cache t
      auth-source-cache-expiry 86400 ; All day, defaut is 2h (7200)
      password-cache t
      password-cache-expiry 86400)

(after! epa
  (setq-default epa-file-encrypt-to '("F808A020A3E1AC37")))
#+end_src

** Better defaults :default:
*** File deletion :delete:trash:
Delete files by moving them to trash.

#+begin_src emacs-lisp
(setq-default delete-by-moving-to-trash t
              trash-directory nil) ;; Use freedesktop.org trashcan
#+end_src

*** Window :window:
Take new window space from all other windows (not just current).

#+begin_src emacs-lisp
(setq-default window-combination-resize t)
#+end_src

**** Split defaults
Split horizontally to right, vertically below the current window.

#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+end_src

Show list of buffers when splitting.

#+begin_src emacs-lisp
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))
#+end_src

*** Messages buffer :messages:buffer:
Stick to buffer tail, useful with =*Messages*= buffer. Derived from [[https://stackoverflow.com/a/6341139/3058915][this answer]].

#+begin_src emacs-lisp
(defvar +messages--auto-tail-enabled nil)

(defun +messages--auto-tail-a (&rest arg)
  "Make *Messages* buffer auto-scroll to the end after each message."
  (let* ((buf-name (buffer-name (messages-buffer)))
         ;; Create *Messages* buffer if it does not exist
         (buf (get-buffer-create buf-name)))
    ;; Activate this advice only if the point is _not_ in the *Messages* buffer
    ;; to begin with. This condition is required; otherwise you will not be
    ;; able to use `isearch' and other stuff within the *Messages* buffer as
    ;; the point will keep moving to the end of buffer :P
    (when (not (string= buf-name (buffer-name)))
      ;; Go to the end of buffer in all *Messages* buffer windows that are
      ;; *live* (`get-buffer-window-list' returns a list of only live windows).
      (dolist (win (get-buffer-window-list buf-name nil :all-frames))
        (with-selected-window win
          (goto-char (point-max))))
      ;; Go to the end of the *Messages* buffer even if it is not in one of
      ;; the live windows.
      (with-current-buffer buf
        (goto-char (point-max))))))

(defun +messages-auto-tail-toggle ()
  "Auto tail the '*Messages*' buffer."
  (interactive)
  (if +messages--auto-tail-enabled
      (progn
        (advice-remove 'message '+messages--auto-tail-a)
        (setq +messages--auto-tail-enabled nil)
        (message "+messages-auto-tail: Disabled."))
    (advice-add 'message :after '+messages--auto-tail-a)
    (setq +messages--auto-tail-enabled t)
    (message "+messages-auto-tail: Enabled.")))
#+end_src

*** Undo and auto-save :save:undo:
**** Auto-save

#+begin_src emacs-lisp :tangle packages.el
(package! super-save
  :disable t)
#+end_src

#+begin_src emacs-lisp
(use-package! super-save
  :ensure t
  :config
  (setq auto-save-default t ;; nil to switch off the built-in `auto-save-mode', maybe leave it t to have a backup!
        super-save-exclude '(".gpg")
        super-save-remote-files nil
        super-save-auto-save-when-idle t)
  (super-save-mode +1))
#+end_src

#+begin_src emacs-lisp
(setq auto-save-default t) ;; enable built-in `auto-save-mode'
#+end_src

**** Undo
Tweak =undo-fu= and other stuff from Doom's =:emacs undo=.

#+begin_src emacs-lisp
;; Increase undo history limits even more
(after! undo-fu
  (setq undo-limit        10000000     ;; 1MB   (default is 160kB, Doom's default is 400kB)
        undo-strong-limit 100000000    ;; 100MB (default is 240kB, Doom's default is 3MB)
        undo-outer-limit  1000000000)) ;; 1GB   (default is 24MB,  Doom's default is 48MB)

(after! evil
  (setq evil-want-fine-undo t)) ;; By default while in insert all changes are one big blob
#+end_src

**** Visual Undo (=vundo=)

#+begin_src emacs-lisp :tangle packages.el
(package! vundo
  :recipe (:host github
           :repo "casouri/vundo"))
#+end_src

#+begin_src emacs-lisp
(use-package! vundo
  :defer t
  :custom
  (vundo-glyph-alist vundo-unicode-symbols)
  (vundo-compact-display t)
  (vundo-window-max-height 5))
#+end_src

*** Editing :edit:cursor:

#+begin_src emacs-lisp
;; Stretch cursor to the glyph width
(setq-default x-stretch-cursor t)

;; Enable relative line numbers
(setq display-line-numbers-type 'relative)

;; Iterate through CamelCase words
(global-subword-mode 1)
#+end_src

*** Emacs sources

#+begin_src emacs-lisp
(setq source-directory
      (expand-file-name "~/Softwares/src/emacs"))
#+end_src

*** Frame :frame:
**** Focus created frame :focus:
The problem is, every time I launch an Emacs frame (from KDE), Emacs starts
with no focus, I need each time to =Alt-TAB= to get Emacs under focus, and then
start typing. I tried changing this behavior from Emacs by hooking =raise-frame=
at startup, but it didn't work.

Got from [[https://emacs.stackexchange.com/a/34740][this comment]], not working on my Emacs version.

#+begin_src emacs-lisp :tangle no
;; NOTE: Not tangled, not working
(add-hook 'server-switch-hook #'raise-frame)
#+end_src

After some investigations, I found that this issue is probably KDE specific, the
issue goes away by setting: *Window Management > Window Behavior > Focus > Focus
stealing prevention* to /None/ in the KDE Settings.

* Emacs daemon :daemon:
** Initialization :init:
When the daemon is running, I almost always want to do a few particular things
with it, so I may as well eat the load time at startup. We also want to keep
=mu4e= running.

Lastly, while I'm not sure quite why it happens, but after a bit it seems that
new Emacs client frames start on the =*scratch*= buffer instead of the dashboard.
I prefer the dashboard, so let's ensure that's always switched to in new frames.

#+begin_src emacs-lisp
(defun +daemon-startup ()
  ;; mu4e
  (when (require 'mu4e nil t)
    ;; Automatically start `mu4e' in background.
    (when (load! "mu-lock.el" (expand-file-name "email/mu4e/autoload" doom-modules-dir) t)
      (setq +mu4e-lock-greedy t
            +mu4e-lock-relaxed t)
      (when (+mu4e-lock-available t)
        (mu4e--start)))

    ;; Check each 5m, if `mu4e' if closed, start it in background.
    (run-at-time
     60 (* 60 5) ;; Check each 5 minutes
     (lambda ()
       (when (and (not (mu4e-running-p)) (+mu4e-lock-available))
         (mu4e--start)
         (message "Started `mu4e' in background.")))))

  ;; RSS
  (when (require 'elfeed nil t)
    (run-at-time nil (* 2 60 60) #'elfeed-update))) ;; Check every 2h

(when (daemonp)
  ;; Daemon startup
  (add-hook 'emacs-startup-hook #'+daemon-startup)
  ;; After creating a new frame (via emacsclient)
  (add-hook!
   'server-after-make-frame-hook
   ;; Reload Doom's theme
   #'doom/reload-theme
   ;; Switch to Dashboard, unless we started in one of the special buffers
   (unless (string-match-p "\\*draft\\|\\*stdin\\|emacs-everywhere" (buffer-name))
     (switch-to-buffer +doom-dashboard-name))))
#+end_src

** Tweaks :tweak:
*** Save recent files :recentf:
When editing files with Emacs client, the files does not get stored by =recentf=,
making Emacs forgets about recently opened files. A quick fix is to hook the
src_elisp{recentf-save-list} command to the src_elisp{delete-frame-functions}
and src_elisp{delete-terminal-functions} which gets executed each time a
frame/terminal is deleted.

#+begin_src emacs-lisp
(when (daemonp)
  (add-hook! '(delete-frame-functions delete-terminal-functions)
    (let ((inhibit-message t))
      (recentf-save-list)
      (savehist-save))))
#+end_src

* Package configuration :package:
** User interface :ui:
